package com.cooperativesolutionism.nmsci.service;

public interface BlockChainService {
//    【版本号4字节(0x1)】+【区块高度8字节】+【相应版本全代码压缩包(包含协议文本)sha256hash摘要32字节】+【前区块(包括区块头与区块体)摘要32字节】+【所有信息默克尔根32字节】+【信息内最大时间戳8字节】+【流转节点注册难度目标4字节】+【消费节点交易难度目标4字节】
//            +【中心公钥公证信息数量8字节】+【中心公钥公证信息220字节】*n
//+【中心公钥冻结信息数量8字节】+【中心公钥冻结信息187字节】*n
//+【流转节点注册信息数量8字节】+【流转节点注册信息228字节】*n
//+【流转节点冻结信息数量8字节】+【流转节点冻结信息220字节】*n
//+【交易记录信息数量8字节】+【交易记录信息335字节】*n
//+【交易挂载信息数量8字节】+【交易挂载信息341字节】*n
//+【中心公钥32字节】+【固定区块时间戳8字节】+【中心公钥对前述所有信息签名64字节】
//    生成区块

}
